In [1]:
# Import the libraries
import pandas as pd
import numpy as np

In [2]:
# Load the data
df = pd.read_csv(r"C:\Users\ASUS\OneDrive\Data Analytic Projects\USA Real Estate Dataset.csv", low_memory=False)

In [3]:
df.shape

(1048575, 15)

In [4]:
# Look at the data
df.head(5)

,brokered_by,status,price,bed,bath,acre_lot,street,city,state,zip_code,house_size,prev_sold_date,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,103378.0,for_sale,105000.0,3.0,2.0,0.12,1962661.0,Adjuntas,Puerto Rico,601.0,920.0,NaN,NaN,NaN,NaN
1,52707.0,for_sale,80000.0,4.0,2.0,0.08,1902874.0,Adjuntas,Puerto Rico,601.0,1527.0,NaN,NaN,NaN,NaN
2,103379.0,for_sale,67000.0,2.0,1.0,0.15,1404990.0,Juana Diaz,Puerto Rico,795.0,748.0,NaN,NaN,NaN,NaN
3,31239.0,for_sale,145000.0,4.0,2.0,0.10,1947675.0,Ponce,Puerto Rico,731.0,1800.0,NaN,NaN,NaN,NaN
4,34632.0,for_sale,65000.0,6.0,2.0,0.05,331151.0,Mayaguez,Puerto Rico,680.0,NaN,NaN,NaN,NaN,

In [5]:
df.info()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 15 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   brokered_by     1047537 non-null  float64
 1   status          1048575 non-null  object
 2   price           1047485 non-null  float64
 3   bed             738569 non-null   float64
 4   bath            723607 non-null   float64
 5   acre_lot        870247 non-null   float64
 6   street          1041799 non-null  float64
 7   city            1047715 non-null  object
 8   state           1048568 non-null  object
 9   zip_code        1048416 non-null  float64
 10  house_size      683689 non-null   float64
 11  prev_sold_date  497886 non-null   object
 12  Unnamed: 12     0 non-null        float64
 13  Unnamed: 13     0 non-null        float64
 14  Unnamed: 14     1 non-null        object
dtypes: float64(10), object(5)
memory usage: 120.0+ MB

,brokered_by,status,price,bed,bath,acre_lot,street,city,state,zip_code,house_size,prev_sold_date,Unnamed: 12,Unnamed: 13,Unnamed: 14
count,1.047537e+06,1048575,1.047485e+06,738569.000000,723607.000000,870247.000000,1.041799e+06,1047715,1048568,1.048416e+06,6.836890e+05,497886,0.0,0.0,1
unique,NaN,2,NaN,NaN,NaN,NaN,NaN,15973,47,NaN,NaN,13847,NaN,NaN,1
top,NaN,for_sale,NaN,NaN,NaN,NaN,NaN,Chicago,Florida,NaN,NaN,4/29/2022,NaN,NaN,
freq,NaN,1031598,NaN,NaN,NaN,NaN,NaN,12688,163840,NaN,NaN,2042,NaN,NaN,1
mean,5.187727e+04,NaN,4.774979e+05,3.309546,2.536147,15.345766,1.055064e+06,NaN,NaN,3.790441e+04,2.137796e+03,NaN,NaN,NaN,NaN
std,3.039121e+04,NaN,2.774217e+06,1.598269,1.675857,747.421182,6.057396e+05,NaN,NaN,1.965920e+04,1.249966e+04,NaN,NaN,NaN,NaN
min,0.000000e+00,NaN,0.000000e+00,1.000000,1.000000,0.000000,3.000000e+00,NaN,NaN,0.000000e+00,4.000000e+00,NaN,NaN,NaN,NaN
25%,2.371300e+04,NaN,1.200000e+05,3.000000,2.000000,0.180000,5.309800e+05,NaN,NaN,2.500500e+04,1.312000e+03,NaN,NaN,NaN,NaN
50%,5.263300e+04,NaN,2.760000e+05,3.000000,2.000000,0.360000,1.064730e+06,NaN,NaN,3.395000e+04,1.800000e+03,NaN,NaN,NaN,NaN
75%,7.883800e+04,NaN,4.820000e+05,4.000000,3.000000,1.300000,1.599512e+06,NaN,NaN,5.322200e+04,2.500000e+03,NaN,NaN,NaN,NaN
max,1.101420e+05,NaN,2.147484e+09,473.000000,752.000000,100000.000000,2.001357e+06,NaN,NaN,9.999900e+04,9.842382e+06,NaN,NaN,NaN,NaN

In [6]:
# Standardize column names
df.columns = (
    df.columns
      .str.strip()
      .str.lower()
      .str.replace(' ', '_')
      .str.replace('-', '_'))

In [7]:
# Drop useless unnamed columns
df.drop(['unnamed:_12', 'unnamed:_13', 'unnamed:_14'], axis=1, inplace=True)

In [8]:
#check duplicates
df.duplicated().sum()

np.int64(0)

In [9]:
# Strip & standardize strings
object_cols = df.select_dtypes(include="object").columns
df[object_cols] = df[object_cols].apply(lambda x: x.astype("string").str.strip())

In [10]:
# Convert numeric columns properly
numeric_cols = ["price", "bed", "bath", "acre_lot", "house_size"]

for col in numeric_cols:
    df[col] = pd.to_numeric(df[col])

In [11]:
int_cols = ["price", "bed", "bath", "house_size"]

for col in int_cols:
    df[col] = df[col].round().astype("Int64")

In [12]:
# Handle ID-like columns
df["brokered_by"] = df["brokered_by"].astype("Int64")
df["street"] = df["street"].astype("Int64")
df["zip_code"] = df["zip_code"].astype("Int64")

In [13]:
df["prev_sold_date"] = pd.to_datetime(
    df["prev_sold_date"]
)

In [14]:
#Check missing values
df.isna().sum()

brokered_by         1038
status                 0
price               1090
bed               310006
bath              324968
acre_lot          178328
street              6776
city                 860
state                  7
zip_code             159
house_size        364886
prev_sold_date    550689
dtype: int64

In [15]:
#Identify critical columns
critical_cols = ["price", "state", "status"]

#Drop rows with nulls only in these columns
df = df.dropna(subset=critical_cols)

In [16]:
#Columns to impute (replace nulls)
df["bed"] = df["bed"].fillna(df["bed"].median())
df["bath"] = df["bath"].fillna(df["bath"].median())
df["city"] = df["city"].fillna("Unknown")
# Acre & house size: keep NaN (important signal)

In [17]:
int_type_cols = df.select_dtypes(include="int").columns
print(int_type_cols)

# Check for impossible values
print("column : shape")
for col in int_type_cols:
    
    print(f"{col} : {df[df[col] <= 0].shape}")

Index(['brokered_by', 'price', 'bed', 'bath', 'street', 'zip_code',
       'house_size'],
      dtype='object')
column : shape
brokered_by : (3, 12)
price : (121, 12)
bed : (0, 12)
bath : (0, 12)
street : (0, 12)
zip_code : (1, 12)
house_size : (0, 12)

In [18]:
#inspect before dropping invalid brokered_by
df.loc[df["brokered_by"] <= 0, ["brokered_by", "price", "status", "state"]].head(10)

        brokered_by   price    status    state
410969            0  190000  for_sale  Georgia
411599            0  279900  for_sale  Georgia
412072            0  265000  for_sale  Georgia

In [19]:
df.loc[df["brokered_by"] == 0, "brokered_by"] = pd.NA

In [20]:
#inspect before dropping invalid prices
df.loc[df["price"] <= 0, ["price", "status", "state"]].head(10)

        price          status           state
46207       0        for_sale      New Jersey
46208       0        for_sale      New Jersey
49607       0        for_sale        New York
57803       0        for_sale      New Jersey
116304      0        for_sale        New York
286067      0  ready_to_build  North Carolina
286068      0  ready_to_build  North Carolina
286069      0  ready_to_build  North Carolina
286070      0  ready_to_build  North Carolina
286072      0  ready_to_build  North Carolina

In [21]:
df.loc[df["price"] == 0, "price"] = pd.NA

In [22]:
df = df.dropna(subset=["price"])

**Listings with price equal to zero were reclassified as missing prices. These primarily correspond to ‘ready_to_build’ or incomplete listings and were excluded only for price-based analyses.**

In [23]:
df[df["acre_lot"] <= 0].shape

(1009, 12)

In [24]:
df.loc[df["acre_lot"] == 0, "acre_lot"] = pd.NA

In [25]:
df = df.dropna(subset=["house_size"])

In [26]:
# Check null ratio and total nulls
df.isna().mean().sort_values(ascending=False) 
df.isna().sum()

brokered_by          619
status                 0
price                  0
bed                    0
bath                   0
acre_lot          149343
street              4185
city                   0
state                  0
zip_code              49
house_size             0
prev_sold_date    284742
dtype: int64

### Adding new useful columns and information

In [27]:
# Price per Sqft
df["price_per_sqft"] = np.where(
    (df["house_size"].notna()) & (df["house_size"] > 0),
    df["price"] / df["house_size"],
    np.nan
)

In [28]:
#Price trends over time by state
df["prev_sold_year"] = df["prev_sold_date"].dt.year.astype('Int64')

**I validated data types, removed invalid values, engineered pricing metrics, preserved meaningful nulls, and exported an analysis-ready fact table for Power BI visualization.**

In [29]:
#Checking distinct states
unique_states = sorted(df['state'].unique())
num_unique_states = df['state'].nunique()

unique_states
#num_unique_states

['Alabama',
 'Arkansas',
 'California',
 'Colorado',
 'Connecticut',
 'Delaware',
 'District of Columbia',
 'Florida',
 'Georgia',
 'Idaho',
 'Illinois',
 'Indiana',
 'Iowa',
 'Kansas',
 'Kentucky',
 'Louisiana',
 'Maine',
 'Maryland',
 'Massachusetts',
 'Michigan',
 'Minnesota',
 'Mississippi',
 'Missouri',
 'Montana',
 'Nebraska',
 'New Hampshire',
 'New Jersey',
 'New Mexico',
 'New York',
 'North Carolina',
 'North Dakota',
 'Ohio',
 'Oklahoma',
 'Pennsylvania',
 'Puerto Rico',
 'Rhode Island',
 'South Carolina',
 'South Dakota',
 'Tennessee',
 'Texas',
 'Vermont',
 'Virgin Islands',
 'Virginia',
 'West Virginia',
 'Wisconsin',
 'Wyoming']

In [30]:
#Sorted data accoording to date, descending order
df = df.sort_values(["prev_sold_year", "prev_sold_date"], ascending=False)

In [31]:
#Export data for visualization
df.to_csv(
    "usa_real_estate_cleaned.csv",
    index=False
)